In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\prabh\appdata\roaming\python\python314\site-packages (3.0.0)
Requirement already satisfied: numpy>=2.3.3 in c:\users\prabh\appdata\roaming\python\python314\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\prabh\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\prabh\appdata\roaming\python\python314\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\prabh\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd 
import numpy as np

In [3]:
s = pd.Series([1,2,3,5,4,5])
s

0    1
1    2
2    3
3    5
4    4
5    5
dtype: int64

In [4]:
a = pd.Series(['a','b','c','d'],index=[10,20,30,40])
a

10    a
20    b
30    c
40    d
dtype: str

In [5]:
a[10]

'a'

In [6]:
a[40]

'd'

In [7]:
#Data Frame
data = {
    "Name": ["Amit", "Riya", "Sohan", "Priya", "Rahul"],
    "Roll Number": [101, 102, 103, 104, 105],
    "Place": ["Delhi", "Mumbai", "Chennai", "Kolkata", "Bangalore"]
}
data

{'Name': ['Amit', 'Riya', 'Sohan', 'Priya', 'Rahul'],
 'Roll Number': [101, 102, 103, 104, 105],
 'Place': ['Delhi', 'Mumbai', 'Chennai', 'Kolkata', 'Bangalore']}

In [8]:
df = pd.DataFrame(data)
df

    Name  Roll Number      Place
0   Amit          101      Delhi
1   Riya          102     Mumbai
2  Sohan          103    Chennai
3  Priya          104    Kolkata
4  Rahul          105  Bangalore

In [9]:
df.head(3)

    Name  Roll Number    Place
0   Amit          101    Delhi
1   Riya          102   Mumbai
2  Sohan          103  Chennai

In [10]:
df.tail(3)

    Name  Roll Number      Place
2  Sohan          103    Chennai
3  Priya          104    Kolkata
4  Rahul          105  Bangalore

In [11]:
df = df.rename(columns={"Name": "Student_name "})
df

  Student_name   Roll Number      Place
0          Amit          101      Delhi
1          Riya          102     Mumbai
2         Sohan          103    Chennai
3         Priya          104    Kolkata
4         Rahul          105  Bangalore

In [12]:
df.drop(columns=["Place"], inplace=True)
df

  Student_name   Roll Number
0          Amit          101
1          Riya          102
2         Sohan          103
3         Priya          104
4         Rahul          105

In [13]:
df.set_index("Roll Number",drop = False,inplace=True)

In [14]:
df

            Student_name   Roll Number
Roll Number
101                  Amit          101
102                  Riya          102
103                 Sohan          103
104                 Priya          104
105                 Rahul          105

In [15]:
import numpy as np

In [16]:
d = pd.DataFrame ({
    "Days": ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday"],
    "Place": ["Park", "Mall", np.nan, "Zoo", "Beach"],
    "Visitors": [120, 95, 150, 110, 180]
})

In [17]:
d

        Days  Place  Visitors
0     Monday   Park       120
1    Tuesday   Mall        95
2  Wednesday    NaN       150
3   Thursday    Zoo       110
4     Friday  Beach       180

In [18]:
d.isnull()

    Days  Place  Visitors
0  False  False     False
1  False  False     False
2  False   True     False
3  False  False     False
4  False  False     False

In [19]:
d.isnull().sum()

Days        0
Place       1
Visitors    0
dtype: int64

In [21]:
df.to_csv('to_data.csv')

In [23]:
load = pd.read_csv('to_data.csv')
load

   Roll Number Student_name   Roll Number.1
0          101          Amit            101
1          102          Riya            102
2          103         Sohan            103
3          104         Priya            104
4          105         Rahul            285